; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	image0 - mode
	thermograph3 - mode
	infrared1 - mode
	image2 - mode
	Star5 - direction
	Star2 - direction
	GroundStation4 - direction
	Star1 - direction
	GroundStation3 - direction
	Star0 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 image0)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument2 infrared1)
	(supports instrument2 image2)
	(calibration_target instrument2 Star1)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 image2)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet15)
)
(:goal (and
	(have_image Phenomenon6 thermograph3)
	(have_image Star7 thermograph3)
	(have_image Planet8 image2)
	(have_image Phenomenon9 thermograph3)
	(have_image Star10 thermograph3)
	(have_image Planet11 infrared1)
	(have_image Star12 image0)
	(have_image Phenomenon13 infrared1)
	(have_image Planet14 image2)
	(have_image Planet15 image2)
	(have_image Star16 image2)
	(have_image Planet17 thermograph3)
))

)

; plan
1. (turn_to satellite1 star1 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star1)
   goals met: 0 of 12
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 12
3. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 0 of 12
4. (turn_to satellite1 planet14 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet14)
   goals met: 0 of 12
5. (take_image satellite1 planet14 instrument2 image2)
   added: (have_image planet14 image2)
   goals met: 1 of 12
6. (turn_to satellite1 planet11 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet11)
   goals met: 1 of 12
7. (take_image satellite1 planet11 instrument2 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 2 of 12
8. (turn_to satellite1 phenomenon13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 12
9. (turn_to satellite0 star1 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star1)
   goals met: 2 of 12
10. (take_image satellite1 phenomenon13 instrument2 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 3 of 12
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 12
12. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 3 of 12
13. (turn_to satellite0 phenomenon6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 12
14. (take_image satellite0 phenomenon6 instrument0 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   goals met: 4 of 12
15. (turn_to satellite0 phenomenon9 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 12
16. (take_image satellite0 phenomenon9 instrument0 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 5 of 12
17. (turn_to satellite0 planet15 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet15)
   goals met: 5 of 12
18. (take_image satellite0 planet15 instrument0 image2)
   added: (have_image planet15 image2)
   goals met: 6 of 12
19. (turn_to satellite0 planet17 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet17)
   goals met: 6 of 12
20. (take_image satellite0 planet17 instrument0 thermograph3)
   added: (have_image planet17 thermograph3)
   goals met: 7 of 12
21. (turn_to satellite0 planet8 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet8)
   goals met: 7 of 12
22. (take_image satellite0 planet8 instrument0 image2)
   added: (have_image planet8 image2)
   goals met: 8 of 12
23. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 8 of 12
24. (take_image satellite0 star10 instrument0 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 9 of 12
25. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 9 of 12
26. (take_image satellite0 star12 instrument0 image0)
   added: (have_image star12 image0)
   goals met: 10 of 12
27. (turn_to satellite0 star16 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star16)
   goals met: 10 of 12
28. (take_image satellite0 star16 instrument0 image2)
   added: (have_image star16 image2)
   goals met: 11 of 12
29. (turn_to satellite0 star7 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star7)
   goals met: 11 of 12
30. (take_image satellite0 star7 instrument0 thermograph3)
   added: (have_image star7 thermograph3)
   goals met: 12 of 12
